#/section11/11-refine2.py
#데이터 정제(2) - 결측치 대처법

from print_df import print_df
from pandas import DataFrame
from sample import grade_dic
import numpy

#pip install sklearn 모듈설치
from sklearn.impute import SimpleImputer

df=DataFrame(grade_dic, index=["철수", "영희", "민철", "수현", "호영"])
print_df(df)
"""원본
<class 'pandas.core.frame.DataFrame'>
(5, 4)
+------+------+------+------+------+
|      | 국어 | 영어 | 수학 | 과학 |
+------+------+------+------+------+
| 철수 |  98  | nan  | 88.0 | 64.0 |
| 영희 |  88  | 90.0 | 62.0 | 72.0 |
| 민철 |  92  | 70.0 | nan  | nan  |
| 수현 |  63  | 60.0 | 31.0 | 70.0 |
| 호영 | 120  | 50.0 | nan  | 88.0 |
+------+------+------+------+------+
"""


#결측치를 특정값으로 채움 → sklearn 모듈이 아닌 Dataframe 자체 기능
re_df1=df.fillna(value=50)
print_df(re_df1)
"""
+------+------+------+------+------+
|      | 국어 | 영어 | 수학 | 과학 |
+------+------+------+------+------+
| 철수 |  98  | 50.0 | 88.0 | 64.0 |
| 영희 |  88  | 90.0 | 62.0 | 72.0 |
| 민철 |  92  | 70.0 | 50.0 | 50.0 |
| 수현 |  63  | 60.0 | 31.0 | 70.0 |
| 호영 | 120  | 50.0 | 50.0 | 88.0 |
+------+------+------+------+------+
"""



#sklearn 모듈 기반으로 결측치 대처
#1) 결측치를 정제할 규칙 정의
#   → 각 열단위로 평균(strategy="mean")을 결측치(missing_values)에 지정
#   →  strategy 옵션 : mean=평균, median=중앙값, most_frequent: 최빈값(가장 많이 관측되는 수)
imr=SimpleImputer(missing_values=numpy.nan, strategy="mean")

#2) dataframe의 값에 대해 규칙 적용
df_imr=imr.fit_transform(df.values)
print_df(df_imr)
"""
[[ 98.          67.5         88.          64.        ]
 [ 88.          90.          62.          72.        ]
 [ 92.          70.          60.33333333  73.5       ]
 [ 63.          60.          31.          70.        ]
 [120.          50.          60.33333333  88.        ]]
"""

#3) 적용된 규칙으로 새로운 데이터 프레임 생성
re_df2=DataFrame(df_imr, index=df.index, columns=df.columns)
print_df(re_df2)
"""
+------+-------+------+--------------------+------+
|          |  국어  | 영어 |        수학             | 과학  |
+------+-------+------+--------------------+------+
| 철수 |  98.0 | 67.5 |        88.0        | 64.0 |
| 영희 |  88.0 | 90.0 |        62.0        | 72.0 |
| 민철 |  92.0 | 70.0 | 60.333333333333336 | 73.5 |
| 수현 |  63.0 | 60.0 |        31.0        | 70.0 |
| 호영 | 120.0 | 50.0 | 60.333333333333336 | 88.0 |
+------+-------+------+--------------------+------+
"""